app/views/employees/_form.html.erb

    <%= f.label :branch_id %><br>
    <%= f.select :branch_id, Branch.select_values %>
---
SELECT "branches"."id", name FROM "branches"