app/views/employees/index.html.erb

SELECT  "branches".* FROM "branches" WHERE "branches"."id" = $1 LIMIT 1  [["id", 1]]
---
        <td><%= employee.user %></td>
        <td><%= Branch.find(employee.branch_id).adress %></td>