app/views/orders_pizzas/_form.html.erb

    <%= f.label :"Orden" %><br>
    <%= f.select :order_id, Order.select_values %>
---
SELECT "orders"."id", adress FROM "orders"