app/views/orders_pizzas/index.html.erb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 1]]
---
      <tr>
        <td><%= orders_pizza.order %></td>