app/views/orders_pizzas/show.html.erb

  <strong>Order:</strong>
  <%= @orders_pizza.order.id %>
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 1]]