app/views/orders/graph.html.erb


<p> <%= bar_chart Order.joins(:branch).group(:"branches.adress").count(:id) %> </p>
---
SELECT COUNT("orders"."id") AS count_id, branches.adress AS branches_adress FROM "orders" INNER JOIN "branches" ON "branches"."id" = "orders"."branch_id" GROUP BY branches.adress