app/views/orders/index.csv.erb

SELECT  "branches".* FROM "branches" WHERE "branches"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT 1  [["id", 3]]
---
<% @orders.each do |orden| %>
    <%= CSV.generate_line([orden.client.name, orden.branch.adress, @precio.first ]) %>