app/controllers/branches_controller.rb

  def index
    @branches = Branch.all
---
SELECT "branches".* FROM "branches"

  def create
    @branch = Branch.new(branch_params)

    respond_to do |format|
      if @branch.save
---
INSERT INTO "branches" ("adress", "postal_code", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["adress", "Loma Linda 298"], ["postal_code", 5100], ["phone_number", "5257-4696"], ["created_at", "2015-04-26 00:53:20.471553"], ["updated_at", "2015-04-26 00:53:20.471553"]]

    def set_branch
      @branch = Branch.find(params[:id])
---
SELECT  "branches".* FROM "branches" WHERE "branches"."id" = $1 LIMIT 1  [["id", 1]]