app/controllers/clients_controller.rb

  def pdf
    @clients = Client.all
---
SELECT "clients".* FROM "clients"

  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("name", "lastname", "phone_number", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"