app/controllers/employees_controller.rb

INSERT INTO "employees" ("name", "lastname", "user", "encrypted_password", "salt", "branch_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save