app/controllers/ingridients_pizzas_controller.rb

SELECT "ingridients_pizzas".* FROM "ingridients_pizzas"
---
  def index
    @ingridients_pizzas = IngridientsPizza.all

INSERT INTO "ingridients_pizzas" ("pizza_id", "ingridient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["pizza_id", 1], ["ingridient_id", 1], ["created_at", "2015-04-28 05:12:04.322204"], ["updated_at", "2015-04-28 05:12:04.322204"]]
---
  def create
    @ingridients_pizza = IngridientsPizza.new(ingridients_pizza_params)

    respond_to do |format|
      if @ingridients_pizza.save

UPDATE "ingridients_pizzas" SET "ingridient_id" = $1, "updated_at" = $2 WHERE "ingridients_pizzas"."id" = $3  [["ingridient_id", 4], ["updated_at", "2015-05-04 00:50:25.567599"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @ingridients_pizza.update(ingridients_pizza_params)

SELECT  "ingridients_pizzas".* FROM "ingridients_pizzas" WHERE "ingridients_pizzas"."id" = $1 LIMIT 1  [["id", 4]]
SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_ingridients_pizza
      @ingridients_pizza = IngridientsPizza.find(params[:id])