app/controllers/ingridients_controller.rb

SELECT "ingridients".* FROM "ingridients"
---
  def index
    @ingridients = Ingridient.all

INSERT INTO "ingridients" ("name", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "salami"], ["price", 15.0], ["created_at", "2015-04-28 05:11:10.882372"], ["updated_at", "2015-04-28 05:11:10.882372"]]
---
  def create
    @ingridient = Ingridient.new(ingridient_params)

    respond_to do |format|
      if @ingridient.save

UPDATE "ingridients" SET "name" = $1, "updated_at" = $2 WHERE "ingridients"."id" = $3  [["name", "Salchicha"], ["updated_at", "2015-05-04 00:46:04.707356"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @ingridient.update(ingridient_params)

DELETE FROM "ingridients" WHERE "ingridients"."id" = $1  [["id", 1]]
---
  def destroy
    @ingridient.destroy

SELECT  "ingridients".* FROM "ingridients" WHERE "ingridients"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_ingridient
      @ingridient = Ingridient.find(params[:id])