app/controllers/managers_controller.rb

SELECT "managers".* FROM "managers"
---
  def index
    @managers = Manager.all

INSERT INTO "managers" ("employee_id", "shift", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["employee_id", 1], ["shift", "Matutino"], ["created_at", "2015-05-02 22:56:51.802038"], ["updated_at", "2015-05-02 22:56:51.802038"]]
---
  def create
    @manager = Manager.new(manager_params)

    respond_to do |format|
      if @manager.save

SELECT  "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_manager
      @manager = Manager.find(params[:id])