app/controllers/orders_controller.rb

INSERT INTO "orders" ("client_id", "branch_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["client_id", 3], ["branch_id", 1], ["created_at", "2015-05-02 02:34:48.597183"], ["updated_at", "2015-05-02 02:34:48.597183"]]
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save