app/controllers/orders_pizzas_controller.rb

  def index
    @orders_pizzas = OrdersPizza.all
---
SELECT "orders_pizzas".* FROM "orders_pizzas"

  def create
    @orders_pizza = OrdersPizza.new(orders_pizza_params)

    respond_to do |format|
      if @orders_pizza.save
---
INSERT INTO "orders_pizzas" ("order_id", "pizza_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["order_id", 1], ["pizza_id", 1], ["created_at", "2015-05-03 00:52:02.623052"], ["updated_at", "2015-05-03 00:52:02.623052"]]

    def set_orders_pizza
      @orders_pizza = OrdersPizza.find(params[:id])
---
SELECT  "orders_pizzas".* FROM "orders_pizzas" WHERE "orders_pizzas"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = $1 LIMIT 1  [["id", 1]]