app/controllers/pizzas_controller.rb

  def index
    @pizzas = Pizza.all
---
SELECT "pizzas".* FROM "pizzas"  ORDER BY "pizzas"."created_at" ASC

  def create
    @pizza = Pizza.new(pizza_params)

    respond_to do |format|
      if @pizza.save
---
INSERT INTO "pizzas" ("name", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "meatlovers"], ["price", 670.0], ["created_at", "2015-04-25 21:42:21.107072"], ["updated_at", "2015-04-25 21:42:21.107072"]]

  def update
    respond_to do |format|
      if @pizza.update(pizza_params)
---
UPDATE "pizzas" SET "name" = $1, "updated_at" = $2 WHERE "pizzas"."id" = $3  [["name", "Tocino"], ["updated_at", "2015-05-04 00:47:06.808374"], ["id", 5]]

  def destroy
    @pizza.destroy
---
DELETE FROM "pizzas" WHERE "pizzas"."id" = $1  [["id", 1]]

    def set_pizza
      @pizza = Pizza.find(params[:id])
---
SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = $1 LIMIT 1  [["id", 5]]