app/controllers/sessions_controller.rb

	def create
		user = Employee.find_by_user(params[:employee][:user])
---
SELECT  "employees".* FROM "employees" WHERE "employees"."user" = $1 LIMIT 1  [["user", "Vanderthal"]]